aaron-bond.better-comments
alefragnani.project-manager
beardedbear.beardedtheme
bierner.emojisense
christian-kohler.path-intellisense
codezombiech.gitignore
cweijan.vscode-mysql-client2
donjayamanne.githistory
dotjoshjohnson.xml
ecmel.vscode-html-css
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-complete-tag
formulahendry.code-runner
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-pull-request-github
johnpapa.vscode-peacock
kisstkondoros.vscode-gutter-preview
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
naumovs.color-highlight
oderwat.indent-rainbow
pflannery.vscode-versionlens
pkief.material-icon-theme
pnp.polacode
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-spanish
usernamehw.errorlens
vscodevim.vim
wix.vscode-import-cost
xcad2k.vscode-thedigitallife
yzhang.markdown-all-in-one
ziyasal.vscode-open-in-github
