tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "ack"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "ca-certificates"
brew "openssl@3"
brew "aspell"
brew "autoconf"
brew "bash"
brew "oniguruma"
brew "bat"
brew "gmp"
brew "mpfr"
brew "btop"
brew "c-ares"
brew "catimg"
brew "cmake"
brew "coreutils"
brew "gettext"
brew "libidn2"
brew "libnghttp2"
brew "curl"
brew "eza"
brew "findutils"
brew "fontconfig"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "hyperfine"
brew "jq"
brew "libfido2"
brew "libpq"
brew "libuv"
brew "libvterm"
brew "mpdecimal"
brew "sqlite"
brew "python@3.12"
brew "z3"
brew "llvm"
brew "luajit"
brew "luv"
brew "make"
brew "mas"
brew "zlib"
brew "mysql-client"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "onefetch"
brew "pnpm"
brew "python-psutil"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "six"
brew "tldr"
brew "tmux"
brew "youplot"
brew "yq"
brew "zoxide"
brew "zsh"
brew "denisidoro/tools/docpars"
cask "arc"
cask "brave-browser"
cask "devtoys"
cask "font-caskaydia-cove-nerd-font"
cask "gimp"
cask "iterm2"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "warp"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "beardedbear.beardedtheme"
vscode "bierner.emojisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-mysql-client2"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "johnpapa.vscode-peacock"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "xcad2k.vscode-thedigitallife"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
